'use strict';
// Task #1
// Постфиксная и префиксная формы
// let a = 1, b = 1;

// let c = ++a; // 2
// let d = b++; // 1
// a = 2
// b = 2

// Task #2
// Результат присваивания

// let a = 2;
//
// let x = 1 + (a *= 2);
// // x = 5
// // a = 4

// Task #3
// Преобразование типов

// "" + 1 + 0 // "10"
// "" - 1 + 0 // -1
// true + false // 1
// 6 / "3" // 2
// "2" * "3" // 6
// 4 + 5 + "px" // "9px"
// "$" + 4 + 5  // "$45"
// "4" - 2 // 2
// "4px" - 2 // Nan
// "  -9  " + 5 // "  -9  5"
// "  -9  " - 5 // -14
// null + 1 // 1
// undefined + 1 // Nan
// " \t \n" - 2 // 0

//Task #4
//Исправьте сложение

// let a = +prompt("Первое число?", 1);
// let b = +prompt("Второе число?", 2);
//
// alert(a + b); // 3

// Task #5
// Операторы сравнения

// 5 > 4 // true
// "ананас" > "яблоко" //false
// "2" > "12" // true
// undefined == null //true
// undefined === null //false
// null == "\n0\n" // false
// null === +"\n0\n" // false